{
  "_class_name": "CustomScheduler",
  "_diffusers_version": "0.32.0.dev0",
  "algorithm_type": "custom_v1",
  "beta_end": 0.02,
  "beta_schedule": "linear",
  "beta_start": 0.0001,
  "dynamic_thresholding_ratio": 0.995,
  "euler_at_final": false,
  "final_sigmas_type": "zero",
  "flow_shift": 3.0,
  "lambda_min_clipped": -1000000.0,
  "lower_order_final": true,
  "num_train_timesteps": 1000,
  "prediction_type": "flow_prediction",
  "rescale_betas_zero_snr": false,
  "sample_max_value": 1.0,
  "solver_order": 3,
  "solver_type": "multistep",
  "steps_offset": 0,
  "thresholding": false,
  "timestep_spacing": "uniform_tau",
  "trained_betas": null,
  "use_beta_sigmas": false,
  "use_exponential_sigmas": false,
  "use_flow_sigmas": true,
  "use_karras_sigmas": false,
  "use_lu_lambdas": false,
  "apply_flow_shift": false,
  "variance_type": null,
  "update_clamp_factor": 2.5,
  "sigma_max": 1.0,
  "sigma_min": 0.002,
  "karras_rho": 7.0,
  "use_heun_final_steps": 3
}
